"""Переменные и операторы"""

userAge = 0 # Объявление переменной
userName, userAge = 'Saneks', 13
"""Объявление переменных в одной строке. Это равноценно
userName = 'Saneks'
userAge = 13
"""
"""Оператор присваивания"""

x = 5 # Объевляем переменную x
y = 10 # Объевляем переменную y
y = x # Присваиваем x к y
print(f'x = {x}') # Выводим значение x
print('-' * 57)
print(f'y = {y}') # Выводим значение y
print('-' * 57)
"""Основные операторы и 
дополнительные операторы 
присваивания"""

num = 5
num += 5 # Оператор сложения
print(num)
print('-' * 57)
num -= 4 # Оператор вычитания
print(num)
print('-' * 57)
num *= 3 # Оператор умножения
print(num)
print('-' * 57)
num /= 2 # Оператор деления
print(num)
print('-' * 57)
num //= 2 # Оператор целочисленного деления
print(num)
print('-' * 57)
num **= 3 # Оператор возведения в степень
print(num)
print('-' * 57)
"""Типы данных в Python"""

